

Part_of_speech = {
    'СУ': 'Существительное',
    'ПП': 'Полное прилагательное',
    'КП': 'Краткое прилагательное',
    'ДЕ': 'Деепричастие',
    'ГЛ': 'Глагол',
    'НА': 'Наречие',
    'ЧИ': 'Числительное',
    'МЕ': 'Местоимение',
    'СО': 'Союз',
    'ПР': 'Предлог'}

Genders = {
    'МР': 'Мужской род',
    'ЖР': 'Женский род',
    'СР': 'Средний род',
    'НР': 'Неопределённый род'}

Cases = {
    'ИП': 'Именительный падеж',
    'РП': 'Родительный падеж',
    'ДП': 'Дательный падеж',
    'ВП': 'Винительный падеж',
    'ТП': 'Творительный падеж',
    'ПП': 'Предложный падеж'}

Numbers = {
    'ЕЧ': 'Единственное число',
    'МЧ': 'Множественное число',
    'НЧ': 'Неопределённое число'}

Times = {
    'НВ': 'Настоящее время',
    'ПВ': 'Прошедшее время',
    'ИН': 'Инфинитив'}

Aspect = {
    'СВ': 'Совершенный вид',
    'НВ': 'Несовершенный вид'}

Persons = {
    '1Л': 'Первое лицо',
    '2Л': 'Второе лицо',
    '3Л': 'Третье лицо',
    'НЛ': 'Неопределённое лицо'}